app/Controllers/Home.php

SELECT *
FROM `diskon`
---
    public function index()
    {
        $data = [
            'diskon' => $this->diskon->findAll()
        ];