app/Controllers/Transaksi.php

SELECT *
FROM `diskon`
WHERE `kode_voucher` = 'N154uhy'
 LIMIT 1
SELECT *
FROM `barang`
WHERE `barang`.`id` = '1'
UPDATE `barang` SET `stok` = 8
WHERE `barang`.`id` IN ('1')
---
    public function buy()
    {
        if($this->request->getPost())
		{
			$data = $this->request->getPost();
			$this->validation->run($data, 'transaksi');
			$errors = $this->validation->getErrors();

			if(!$errors){
				$transaksi = new \App\Entities\Transaksi();

				$id_barang = $this->request->getPost('id_barang');
				$jumlah_pembelian = $this->request->getPost('jumlah');
				$total_harga = $this->request->getPost('total_harga');
				$kodeVoucher = $this->request->getPost('kodeVoucher');
				$dataVoc = $this->diskon->where('kode_voucher', $kodeVoucher)->first();

				$barang = $this->barang->find($id_barang);
				$entityBarang = new \App\Entities\Barang();

				$entityBarang->id = $id_barang;

				$entityBarang->stok = $barang->stok-$jumlah_pembelian;
				$this->barang->save($entityBarang);